# Import

In [1]:
import sqlite3
import pandas as pd

# Loading Data

## 1. Brands

In [2]:
brands_df = pd.read_csv('Notebook/Bike Store SQL/brands.csv', sep=',', encoding='utf-8')
brands_df.head(5)

   brand_id   brand_name
0         1      Electra
1         2         Haro
2         3       Heller
3         4  Pure Cycles
4         5      Ritchey

## 2. Categories

In [3]:
categories_df = pd.read_csv('Notebook/Bike Store SQL/categories.csv', sep=',', encoding='utf-8')
categories_df.head(5)

   category_id        category_name
0            1    Children Bicycles
1            2     Comfort Bicycles
2            3    Cruisers Bicycles
3            4  Cyclocross Bicycles
4            5       Electric Bikes

## 3. Customers

In [4]:
customers_df = pd.read_csv('Notebook/Bike Store SQL/customers.csv', sep=',', encoding='utf-8')
customers_df.head(5)

,customer_id,first_name,last_name,phone,email,street,city,state,zip_code
0,1,Debra,Burks,NaN,debra.burks@yahoo.com,9273 Thorne Ave.,Orchard Park,NY,14127
1,2,Kasha,Todd,NaN,kasha.todd@yahoo.com,910 Vine Street,Campbell,CA,95008
2,3,Tameka,Fisher,NaN,tameka.fisher@aol.com,769C Honey Creek St.,Redondo Beach,CA,90278
3,4,Daryl,Spence,NaN,daryl.spence@aol.com,988 Pearl Lane,Uniondale,NY,11553
4,5,Charolette,Rice,(916) 381-6003,charolette.rice@msn.com,107 River Dr.,Sacramento,CA,95820

## 4. Order Items

In [5]:
order_items_df = pd.read_csv('Notebook/Bike Store SQL/order_items.csv', sep=',', encoding='utf-8')
order_items_df.head(5)

   order_id  item_id  product_id  quantity  list_price  discount
0         1        1          20         1      599.99      0.20
1         1        2           8         2     1799.99      0.07
2         1        3          10         2     1549.00      0.05
3         1        4          16         2      599.99      0.05
4         1        5           4         1     2899.99      0.20

## 5. Orders

In [6]:
orders_df = pd.read_csv('Notebook/Bike Store SQL/orders.csv', sep=',', encoding='utf-8')
orders_df.head(5)

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6

## 6. Products

In [7]:
products_df = pd.read_csv('Notebook/Bike Store SQL/products.csv', sep=',', encoding='utf-8')
products_df.head(5)

,product_id,product_name,brand_id,category_id,model_year,list_price
0,1,Trek 820 - 2016,9,6,2016,379.99
1,2,Ritchey Timberwolf Frameset - 2016,5,6,2016,749.99
2,3,Surly Wednesday Frameset - 2016,8,6,2016,999.99
3,4,Trek Fuel EX 8 29 - 2016,9,6,2016,2899.99
4,5,Heller Shagamaw Frame - 2016,3,6,2016,1320.99

## 7. Staffs

In [8]:
staffs_df = pd.read_csv('Notebook/Bike Store SQL/staffs.csv', sep=',', encoding='utf-8')
staffs_df.head(5)

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id
0,1,Fabiola,Jackson,fabiola.jackson@bikes.shop,(831) 555-5554,1,1,NaN
1,2,Mireya,Copeland,mireya.copeland@bikes.shop,(831) 555-5555,1,1,1.0
2,3,Genna,Serrano,genna.serrano@bikes.shop,(831) 555-5556,1,1,2.0
3,4,Virgie,Wiggins,virgie.wiggins@bikes.shop,(831) 555-5557,1,1,2.0
4,5,Jannette,David,jannette.david@bikes.shop,(516) 379-4444,1,2,1.0

## 8. Stocks

In [9]:
stocks_df = pd.read_csv('Notebook/Bike Store SQL/stocks.csv', sep=',', encoding='utf-8')
stocks_df.head(50)

    store_id  product_id  quantity
0          1           1        27
1          1           2         5
2          1           3         6
3          1           4        23
4          1           5        22
5          1           6         0
6          1           7         8
7          1           8         0
8          1           9        11
9          1          10        15
10         1          11         8
11         1          12        16
12         1          13        13
13         1          14         8
14         1          15         3
15         1          16         4
16         1          17         2
17         1          18        16
18         1          19         4
19         1          20        26
20         1          21        24
21         1          22        29
22         1          23         9
23         1          24        10
24         1          25        10
25         1          26        16
26         1          27        21
27         1          28        20
28         1          29        13
29         1          30        30
30         1          31         2
31         1          32         0
32         1          33        10
33         1          34         2
34         1          35        18
35         1          36        26
36         1          37        12
37         1          38        13
38         1          39         2
39         1          40        24
40         1          41        10
41         1          42         0
42         1          43         2
43         1          44         1
44         1          45        15
45         1          46        19
46         1          47        21
47         1          48         5
48         1          49         8
49         1          50        29

## 9. Stores

In [10]:
stores_df = pd.read_csv('Notebook/Bike Store SQL/stores.csv', sep=',', encoding='utf-8')
stores_df.head(5)

,store_id,store_name,phone,email,street,city,state,zip_code
0,1,Santa Cruz Bikes,(831) 476-4321,santacruz@bikes.shop,3700 Portola Drive,Santa Cruz,CA,95060
1,2,Baldwin Bikes,(516) 379-8888,baldwin@bikes.shop,4200 Chestnut Lane,Baldwin,NY,11432
2,3,Rowlett Bikes,(972) 530-5555,rowlett@bikes.shop,8000 Fairway Avenue,Rowlett,TX,75088

# Connect to Database

In [11]:
# Membuka koneksi ke database SQLite (akan dibuat jika tidak ada)
conn = sqlite3.connect('bike_store.db')
cursor = conn.cursor()

#import os
#os.remove('bike_store.db')

# Build a Table

In [12]:
# Membuat tabel brands
cursor.execute('''
CREATE TABLE IF NOT EXISTS brands (
    brand_id INTEGER PRIMARY KEY,
    brand_name TEXT(30)
)
''')

# Membuat tabel categories
cursor.execute('''
CREATE TABLE IF NOT EXISTS categories (
    category_id INTEGER PRIMARY KEY,
    category_name TEXT
)
''')

# Membuat tabel customers
cursor.execute('''
CREATE TABLE IF NOT EXISTS customers (
    customer_id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    phone TEXT(13),
    email TEXT,
    street TEXT,
    city TEXT
)
''')

# Membuat tabel order_items
cursor.execute('''
CREATE TABLE IF NOT EXISTS order_items (
    order_id INTEGER,
    item_id INTEGER,
    product_id INTEGER,
    quantity INTEGER,
    list_price REAL,
    discount REAL,
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
)
''')

# Membuat tabel orders
cursor.execute('''
CREATE TABLE IF NOT EXISTS orders (
    order_id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    order_status INTEGER,
    order_date TEXT,
    required_date TEXT(10),
    shipped_date TEXT(10),
    store_id INTEGER,
    staff_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY (store_id) REFERENCES stores(store_id),
    FOREIGN KEY (staff_id) REFERENCES staffs(staff_id)
)
''')

# Membuat tabel products
cursor.execute('''
CREATE TABLE IF NOT EXISTS products (
    product_id INTEGER PRIMARY KEY,
    product_name TEXT,
    brand_id INTEGER,
    category_id INTEGER,
    model_year INTEGER,
    list_price REAL,
    FOREIGN KEY (category_id) REFERENCES categories(category_id),
    FOREIGN KEY (brand_id) REFERENCES brands(brand_id)
)
''')

# Membuat tabel staffs
cursor.execute('''
CREATE TABLE IF NOT EXISTS staffs (
    staff_id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    email TEXT,
    phone TEXT(14),
    active INTEGER,
    store_id INTEGER,
    manager_id INTEGER,
    FOREIGN KEY (store_id) REFERENCES stores(store_id)
)
''')

# Membuat tabel stocks
cursor.execute('''
CREATE TABLE IF NOT EXISTS stocks (
    store_id INTEGER,
    product_id INTEGER,
    quantity INTEGER,
    FOREIGN KEY (store_id) REFERENCES stores(store_id),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
)
''')

# Membuat tabel stores
cursor.execute('''
CREATE TABLE IF NOT EXISTS stores (
    store_id INTEGER PRIMARY KEY,
    store_name TEXT,
    phone TEXT(14),
    email TEXT,
    street TEXT,
    city TEXT,
    state TEXT(2),
    zip_code INTEGER
)
''')

# Commit perubahan untuk memastikan tabel dibuat
conn.commit()

# Fill the table

In [13]:
# Menambahkan data dari brands.csv ke dalam tabel brands
for index, row in brands_df.iterrows():
    cursor.execute('''
    INSERT INTO brands (brand_id, brand_name)
    VALUES (?, ?)
    ''', (row['brand_id'], row['brand_name']))

# Menambahkan data dari categories.csv ke dalam tabel categories
for index, row in categories_df.iterrows():
    cursor.execute('''
    INSERT INTO categories (category_id, category_name)
    VALUES (?, ?)
    ''', (row['category_id'], row['category_name']))

# Menambahkan data dari customers.csv ke dalam tabel customers
for index, row in customers_df.iterrows():
    cursor.execute('''
    INSERT INTO customers (customer_id, first_name, last_name, phone, email, street, city)
    VALUES (?, ?, ?, ?, ?, ?, ?)
    ''', (row['customer_id'], row['first_name'], row['last_name'], row['phone'], row['email'], row['street'], row['city']))

# Menambahkan data dari order_items.csv ke dalam tabel order_items
for index, row in order_items_df.iterrows():
    cursor.execute('''
    INSERT INTO order_items (order_id, item_id, product_id, quantity, list_price, discount)
    VALUES (?, ?, ?, ?, ?, ?)
    ''', (row['order_id'], row['item_id'], row['product_id'], row['quantity'], row['list_price'], row['discount']))

# Menambahkan data dari orders.csv ke dalam tabel orders
for index, row in orders_df.iterrows():
    cursor.execute('''
    INSERT INTO orders (order_id, customer_id, order_status, order_date, required_date, shipped_date, store_id, staff_id)
    VALUES (?, ?, ?, ?, ?, ?, ?, ?)
    ''', (row['order_id'], row['customer_id'], row['order_status'], row['order_date'], row['required_date'], row['shipped_date'], row['store_id'], row['staff_id']))

# Menambahkan data dari products.csv ke dalam tabel products
for index, row in products_df.iterrows():
    cursor.execute('''
    INSERT INTO products (product_id, product_name, brand_id, category_id, model_year, list_price)
    VALUES (?, ?, ?, ?, ?, ?)
    ''', (row['product_id'], row['product_name'], row['brand_id'], row['category_id'], row['model_year'], row['list_price']))

# Menambahkan data dari staffs.csv ke dalam tabel staffs
for index, row in staffs_df.iterrows():
    cursor.execute('''
    INSERT INTO staffs (staff_id, first_name, last_name, email, phone, active, store_id, manager_id)
    VALUES (?, ?, ?, ?, ?, ?, ?, ?)
    ''', (row['staff_id'], row['first_name'], row['last_name'], row['email'], row['phone'], row['active'], row['store_id'], row['manager_id']))


# Menambahkan data dari stocks.csv ke dalam tabel stocks
for index, row in stocks_df.iterrows():
    cursor.execute('''
    INSERT INTO stocks (store_id, product_id, quantity)
    VALUES (?, ?, ?)
    ''', (int(row['store_id']), int(row['product_id']), int(row['quantity'])))

# Menambahkan data dari stores.csv ke dalam tabel stores
for index, row in stores_df.iterrows():
    cursor.execute('''
    INSERT INTO stores (store_id, store_name, phone, email, street, city, state, zip_code)
    VALUES (?, ?, ?, ?, ?, ?, ?, ?)
    ''', (row['store_id'], row['store_name'], row['phone'], row['email'], row['street'], row['city'], row['state'], row['zip_code']))

# Commit perubahan untuk memastikan data dimasukkan
conn.commit()

# Check Relationship Table

![](Notebook/bikestore.png)

In [14]:
# Menampilkan data customer yang terhubung dengan membership dan payment_details
cursor.execute('''
SELECT c.first_name, o.order_date, s.phone, s.city
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id  -- Menghubungkan customer dengan membership
JOIN stores s ON o.store_id = s.store_id  -- Menghubungkan customer dengan payment_details
ORDER BY s.city ASC LIMIT 10;
''')

# Menampilkan hasil query
rows = cursor.fetchall()
for row in rows:
    print(row)

('Jaqueline', '2016-01-01', '(516) 379-8888', 'Baldwin')
('Joshua', '2016-01-02', '(516) 379-8888', 'Baldwin')
('Arla', '2016-01-03', '(516) 379-8888', 'Baldwin')
('Sharyn', '2016-01-04', '(516) 379-8888', 'Baldwin')
('Laureen', '2016-01-04', '(516) 379-8888', 'Baldwin')
('Leslie', '2016-01-04', '(516) 379-8888', 'Baldwin')
('Alane', '2016-01-05', '(516) 379-8888', 'Baldwin')
('Tarra', '2016-01-05', '(516) 379-8888', 'Baldwin')
('Patience', '2016-01-08', '(516) 379-8888', 'Baldwin')
('Ellsworth', '2016-01-09', '(516) 379-8888', 'Baldwin')

# Question

## Sales & Customers:

### 1. How many total orders have been placed by each customer?

In [15]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT customer_id, COUNT(order_id) AS total_orders
FROM orders
GROUP BY customer_id
ORDER BY total_orders DESC
LIMIT 10;
''')

# Menampilkan hasil query
rows = cursor.fetchall()
for row in rows:
    print(row)

(116, 3)
(77, 3)
(68, 3)
(66, 3)
(64, 3)
(61, 3)
(56, 3)
(53, 3)
(50, 3)
(47, 3)

### 2. Which customer has made the most purchases in the last month?

In [16]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT customer_id, COUNT(order_id) AS total_orders
FROM orders
WHERE order_date >= DATE('now', '-1 month')
GROUP BY customer_id
ORDER BY total_orders DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Customer ID: {result[0]} has made the most purchases with {result[1]} orders in the last month.")
else:
    print("No orders were made in the last month.")

No orders were made in the last month.

### 3. What is the average number of items ordered per order?

In [17]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT AVG(item_count) AS average_items_per_order
FROM (
    SELECT order_id, SUM(quantity) AS item_count
    FROM order_items
    GROUP BY order_id
);
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"The average number of items ordered per order is: {result[0]:.2f}")
else:
    print("No order items data available.")

The average number of items ordered per order is: 4.38

### 4.How many orders have not been shipped yet (where the shipped_date is empty)?

In [18]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT COUNT(order_id) AS orders_not_shipped
FROM orders
WHERE shipped_date IS NULL;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"The number of orders that have not been shipped yet: {result[0]}")
else:
    print("No orders found.")

The number of orders that have not been shipped yet: 170

### 5. Which city has the highest number of customers?

In [19]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT city, COUNT(customer_id) AS total_customers
FROM customers
GROUP BY city
ORDER BY total_customers DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"The city with the highest number of customers is: {result[0]} with {result[1]} customers.")
else:
    print("No customer data available.")

The city with the highest number of customers is: Mount Vernon with 20 customers.

## Orders & Stores:

### 6. Which store has the highest number of orders in the past year?

In [20]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT store_id, COUNT(order_id) AS total_orders
FROM orders
WHERE order_date >= DATE('now', '-1 year')
GROUP BY store_id
ORDER BY total_orders DESC
LIMIT 1;
''')

# Menampilkan hasil query
if result:
    print(f"The store with the highest number of orders in the past year is store ID: {result[0]} with {result[1]} orders.")
else:
    print("No orders found in the past year.")

The store with the highest number of orders in the past year is store ID: Mount Vernon with 20 orders.

### 7. What is the total revenue per store based on sales transactions?

In [21]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT o.store_id, SUM(oi.quantity * (oi.list_price - oi.discount)) AS total_revenue
FROM orders o
JOIN order_items oi ON o.order_id = oi.order_id
GROUP BY o.store_id;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Store ID: {row[0]} - Total Revenue: {row[1]:.2f}")

Store ID: 1 - Total Revenue: 1789987.26
Store ID: 2 - Total Revenue: 5825734.57
Store ID: 3 - Total Revenue: 962521.97

### 8. How many staff members are working in each store?

In [22]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT store_id, COUNT(staff_id) AS total_staff
FROM staffs
GROUP BY store_id;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Store ID: {row[0]} - Total Staff: {row[1]}")

Store ID: 1 - Total Staff: 4
Store ID: 2 - Total Staff: 3
Store ID: 3 - Total Staff: 3

### 9. Which staff member has handled the most orders?

In [23]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT s.staff_id, s.first_name, s.last_name, COUNT(o.order_id) AS total_orders
FROM orders o
JOIN staffs s ON o.staff_id = s.staff_id
GROUP BY s.staff_id
ORDER BY total_orders DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Staff Member: {result[1]} {result[2]} (Staff ID: {result[0]}) handled the most orders: {result[3]} orders.")
else:
    print("No orders found.")

Staff Member: Marcelene Boyer (Staff ID: 6) handled the most orders: 553 orders.

### 10. How many orders does each store process per month?

In [24]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT store_id, strftime('%Y-%m', order_date) AS month, COUNT(order_id) AS total_orders
FROM orders
GROUP BY store_id, month
ORDER BY store_id, month
LIMIT 10;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Store ID: {row[0]} - Month: {row[1]} - Total Orders: {row[2]}")

Store ID: 1 - Month: 2016-01 - Total Orders: 14
Store ID: 1 - Month: 2016-02 - Total Orders: 10
Store ID: 1 - Month: 2016-03 - Total Orders: 10
Store ID: 1 - Month: 2016-04 - Total Orders: 12
Store ID: 1 - Month: 2016-05 - Total Orders: 8
Store ID: 1 - Month: 2016-06 - Total Orders: 8
Store ID: 1 - Month: 2016-07 - Total Orders: 4
Store ID: 1 - Month: 2016-08 - Total Orders: 11
Store ID: 1 - Month: 2016-09 - Total Orders: 15
Store ID: 1 - Month: 2016-10 - Total Orders: 17

## Products & Inventory:

### 11. Which product has been sold the most in the past year?

In [25]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT p.product_id, p.product_name, SUM(oi.quantity) AS total_quantity_sold
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
JOIN orders o ON oi.order_id = o.order_id
WHERE o.order_date >= DATE('now', '-1 year')
GROUP BY p.product_id
ORDER BY total_quantity_sold DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Product: {result[1]} (Product ID: {result[0]}) has been sold the most with {result[2]} units in the past year.")
else:
    print("No orders found in the past year.")

No orders found in the past year.

### 12. Which product category generates the highest sales?

In [26]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT c.category_id, c.category_name, SUM(oi.quantity * (oi.list_price - oi.discount)) AS total_sales
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
JOIN categories c ON p.category_id = c.category_id
JOIN orders o ON oi.order_id = o.order_id
GROUP BY c.category_id
ORDER BY total_sales DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Category: {result[1]} (Category ID: {result[0]}) generates the highest sales of {result[2]:.2f}.")
else:
    print("No sales data available.")

Category: Mountain Bikes (Category ID: 6) generates the highest sales of 3030590.90.

### 13. What is the total stock of products available in each store?

In [27]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT st.store_id, SUM(st.quantity) AS total_stock
FROM stocks st
GROUP BY st.store_id;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Store ID: {row[0]} - Total Stock: {row[1]} units")

Store ID: 1 - Total Stock: 4532 units
Store ID: 2 - Total Stock: 4359 units
Store ID: 3 - Total Stock: 4620 units

### 14. What is the average selling price of products based on category?

In [28]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT c.category_id, c.category_name, AVG(p.list_price) AS avg_selling_price
FROM products p
JOIN categories c ON p.category_id = c.category_id
GROUP BY c.category_id;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Category: {row[1]} (Category ID: {row[0]}) - Average Selling Price: {row[2]:.2f}")

Category: Children Bicycles (Category ID: 1) - Average Selling Price: 287.79
Category: Comfort Bicycles (Category ID: 2) - Average Selling Price: 682.12
Category: Cruisers Bicycles (Category ID: 3) - Average Selling Price: 730.41
Category: Cyclocross Bicycles (Category ID: 4) - Average Selling Price: 2542.79
Category: Electric Bikes (Category ID: 5) - Average Selling Price: 3281.66
Category: Mountain Bikes (Category ID: 6) - Average Selling Price: 1649.76
Category: Road Bikes (Category ID: 7) - Average Selling Price: 3175.36

### 15. Which brand has the highest number of products in the database?

In [29]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT b.brand_id, b.brand_name, COUNT(p.product_id) AS product_count
FROM products p
JOIN brands b ON p.brand_id = b.brand_id
GROUP BY b.brand_id
ORDER BY product_count DESC
LIMIT 1;
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Brand: {result[1]} (Brand ID: {result[0]}) has the highest number of products: {result[2]} products.")
else:
    print("No products found.")

Brand: Trek (Brand ID: 9) has the highest number of products: 135 products.

## Discount & Pricing:

### 16. What is the average discount given per product?

In [30]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT p.product_id, p.product_name, AVG(oi.discount) AS avg_discount
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
GROUP BY p.product_id
LIMIT 10;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Product: {row[1]} (Product ID: {row[0]}) - Average Discount: {row[2]:.2f}")

Product: Ritchey Timberwolf Frameset - 2016 (Product ID: 2) - Average Discount: 0.11
Product: Surly Wednesday Frameset - 2016 (Product ID: 3) - Average Discount: 0.11
Product: Trek Fuel EX 8 29 - 2016 (Product ID: 4) - Average Discount: 0.11
Product: Heller Shagamaw Frame - 2016 (Product ID: 5) - Average Discount: 0.11
Product: Surly Ice Cream Truck Frameset - 2016 (Product ID: 6) - Average Discount: 0.10
Product: Trek Slash 8 27.5 - 2016 (Product ID: 7) - Average Discount: 0.10
Product: Trek Remedy 29 Carbon Frameset - 2016 (Product ID: 8) - Average Discount: 0.10
Product: Trek Conduit+ - 2016 (Product ID: 9) - Average Discount: 0.10
Product: Surly Straggler - 2016 (Product ID: 10) - Average Discount: 0.11
Product: Surly Straggler 650b - 2016 (Product ID: 11) - Average Discount: 0.11

### 17. How does discounting affect the number of items sold?

In [31]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT p.product_id, p.product_name, AVG(oi.discount) AS avg_discount, SUM(oi.quantity) AS total_quantity_sold
FROM order_items oi
JOIN products p ON oi.product_id = p.product_id
GROUP BY p.product_id
ORDER BY avg_discount DESC
LIMIT 10;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Product: {row[1]} (Product ID: {row[0]}) - Average Discount: {row[2]:.2f} - Total Quantity Sold: {row[3]}")

Product: Electra Townie Original 21D EQ Ladies' - 2018 (Product ID: 314) - Average Discount: 0.20 - Total Quantity Sold: 2
Product: Electra Townie Original 21D - 2018 (Product ID: 299) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Electra Treasure 3i 20" - 2018 (Product ID: 296) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Electra Soft Serve 1 (16-inch) - Girl's - 2018 (Product ID: 285) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Trek Precaliber 24 7-speed Girl's - 2018 (Product ID: 279) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Electra Cruiser Lux 7D Ladies' - 2018 (Product ID: 232) - Average Discount: 0.20 - Total Quantity Sold: 2
Product: Trek Lift+ Lowstep - 2018 (Product ID: 189) - Average Discount: 0.20 - Total Quantity Sold: 2
Product: Trek Domane SL 5 Women's - 2018 (Product ID: 183) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Trek Domane SLR Disc Frameset - 2018 (Product ID: 174) - Average Discount: 0.20 - Total Quantity Sold: 1
Product: Trek Remedy 9.8 27.5 - 2018 (Product ID: 140) - Average Discount: 0.20 - Total Quantity Sold: 3

### 18. How has product pricing changed over the years based on model year?

In [32]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT p.model_year, AVG(p.list_price) AS avg_price
FROM products p
GROUP BY p.model_year
ORDER BY p.model_year;
''')

# Menampilkan hasil query
results = cursor.fetchall()
for row in results:
    print(f"Model Year: {row[0]} - Average Price: {row[1]:.2f}")

Model Year: 2016 - Average Price: 980.30
Model Year: 2017 - Average Price: 1279.93
Model Year: 2018 - Average Price: 1658.47
Model Year: 2019 - Average Price: 2583.32

### 19. What is the total revenue before and after discounts in a given period?

In [33]:
# Menampilkan jumlah customer berdasarkan jumlah order
cursor.execute('''
SELECT 
    SUM(oi.quantity * oi.list_price) AS total_revenue_before_discount,
    SUM(oi.quantity * (oi.list_price - oi.discount)) AS total_revenue_after_discount
FROM order_items oi
JOIN orders o ON oi.order_id = o.order_id
WHERE o.order_date BETWEEN '2016-01-01' AND '2018-10-01';
''')

# Menampilkan hasil query
result = cursor.fetchone()
if result:
    print(f"Total Revenue Before Discount: {result[0]:.2f}")
    print(f"Total Revenue After Discount: {result[1]:.2f}")
else:
    print("No orders found for the specified period.")

Total Revenue Before Discount: 8554490.07
Total Revenue After Discount: 8553747.28

In [34]:
# Menutup koneksi
conn.close()

#